In [1]:
import pandas as pd

* series---- 1d array
* data frame----2d array(table formate, rows & col)

In [2]:
a =pd.Series([])
b =pd.Series([1,2,3,44,55,66])
c =pd.Series((45,56,67,78,90))
d =pd.Series({'a':10,'b':12,'c':56,'d':99})

C:\Users\hp\AppData\Local\Temp\ipykernel_13092\2265999003.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  a =pd.Series([])

In [3]:
print(type(a))
print(type(b))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [4]:
print(a)

Series([], dtype: float64)

In [5]:
print(b)

0     1
1     2
2     3
3    44
4    55
5    66
dtype: int64

In [6]:
print(d)

a    10
b    12
c    56
d    99
dtype: int64

In [7]:
c

0    45
1    56
2    67
3    78
4    90
dtype: int64

In [8]:
import numpy as np

In [9]:
n = np.array([1,2,3,4,5])

In [10]:
x = pd.Series(n)

In [11]:
x

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [12]:
type(x)

pandas.core.series.Series

In [13]:
b = pd.Series([1,2,3,[23,45],4,[67,89],5,6,7])

In [14]:
b

0           1
1           2
2           3
3    [23, 45]
4           4
5    [67, 89]
6           5
7           6
8           7
dtype: object

In [15]:
b[1:2]

1    2
dtype: object

In [16]:
b[3:5]

3    [23, 45]
4           4
dtype: object

In [17]:
b[5:7:2]

5    [67, 89]
dtype: object

In [18]:
d

a    10
b    12
c    56
d    99
dtype: int64

In [19]:
d[3]

99

In [20]:
d['c']

56

In [21]:
 s = pd.Series([12,23,34,45],index=['f','g','y','t'])

In [22]:
s

f    12
g    23
y    34
t    45
dtype: int64

In [23]:
 s = pd.Series([12,23,34,45],index=list('qwer'))

In [24]:
s

q    12
w    23
e    34
r    45
dtype: int64

In [25]:
s.idxmax()

'r'

In [26]:
s1 = pd.Series([12,23,34,45,34,23,555,67,78])

In [27]:
s1

0     12
1     23
2     34
3     45
4     34
5     23
6    555
7     67
8     78
dtype: int64

In [28]:
s1.value_counts()

23     2
34     2
12     1
45     1
555    1
67     1
78     1
dtype: int64

In [29]:
s1.max()

555

In [30]:
s1.min()

12

In [31]:
s1.argmax()

6

In [32]:
s1.argmin()

0

# Data Frame

In [33]:
a=pd.DataFrame()
b=pd.DataFrame([1,2,3,44,55,66])

In [34]:
a

Empty DataFrame
Columns: []
Index: []

In [35]:
b

    0
0   1
1   2
2   3
3  44
4  55
5  66

In [36]:
type(b)

pandas.core.frame.DataFrame

In [37]:
c = pd.DataFrame([[1,2,3,4],[5,6,7,8],[10,11,12,14]])

In [38]:
c

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2  10  11  12  14

In [39]:
c1 = pd.DataFrame([[1,2,3,4,5],[5,6,7,8,9],[10,11,12,13,14],[12,23,34,45,56],[98,98,87,76,65]])

In [40]:
c1

    0   1   2   3   4
0   1   2   3   4   5
1   5   6   7   8   9
2  10  11  12  13  14
3  12  23  34  45  56
4  98  98  87  76  65

In [41]:
c1.tail(3)

    0   1   2   3   4
2  10  11  12  13  14
3  12  23  34  45  56
4  98  98  87  76  65

In [42]:
c1.head(4)

    0   1   2   3   4
0   1   2   3   4   5
1   5   6   7   8   9
2  10  11  12  13  14
3  12  23  34  45  56

In [43]:
c1.sample()

   0  1  2  3  4
0  1  2  3  4  5

In [44]:
c1.sample(3)

    0   1   2   3   4
1   5   6   7   8   9
4  98  98  87  76  65
3  12  23  34  45  56

In [45]:
c2=pd.DataFrame([[1,2,3,4,],[5,6,7,8,9],[10,11,12,13,14],[23,34,45,56,],[98,87,76,65,]])

In [46]:
c2

    0   1   2   3     4
0   1   2   3   4   NaN
1   5   6   7   8   9.0
2  10  11  12  13  14.0
3  23  34  45  56   NaN
4  98  87  76  65   NaN

In [47]:
c1 = pd.DataFrame([[1,2,3,4,5],[5,6,7,8,9],[11,np.nan,12,13,14],[12,23,34,np.nan,56],[98,98,87,76,65]])

In [48]:
c1

    0     1   2     3   4
0   1   2.0   3   4.0   5
1   5   6.0   7   8.0   9
2  11   NaN  12  13.0  14
3  12  23.0  34   NaN  56
4  98  98.0  87  76.0  65

In [49]:
c2 = pd.DataFrame([[1,2,3,4],[5,6,7,8,9],[11,np.nan,12,13,'missing'],[12,23,34,np.nan,56],[98,98,87,76,65]])

In [50]:
c2

    0     1   2     3        4
0   1   2.0   3   4.0     None
1   5   6.0   7   8.0        9
2  11   NaN  12  13.0  missing
3  12  23.0  34   NaN       56
4  98  98.0  87  76.0       65

In [51]:
c3 = pd.DataFrame([[1,2,3,4],[5,6,7,8,9],[11,np.nan,12,13,'missing'],[12,23,34,np.nan,56],[98,98,87,76,65]],[1,2,7,4,5])

###

In [52]:
c3

    0     1   2     3        4
1   1   2.0   3   4.0     None
2   5   6.0   7   8.0        9
7  11   NaN  12  13.0  missing
4  12  23.0  34   NaN       56
5  98  98.0  87  76.0       65

In [53]:
c3 = pd.DataFrame([[1,2,3,4],[5,6,7,8,9],[11,np.nan,12,13,'missing'],[12,23,34,np.nan,56],[98,98,87,76,65]],[1,2,7,4,5],[3,44,55,66,77])

In [54]:
c3

   3     44  55    66       77
1   1   2.0   3   4.0     None
2   5   6.0   7   8.0        9
7  11   NaN  12  13.0  missing
4  12  23.0  34   NaN       56
5  98  98.0  87  76.0       65

In [55]:
c3 = pd.DataFrame([[1,2,3,4],[5,6,7,8,9],[11,np.nan,12,13,'missing'],[12,23,34,np.nan,56],[98,98,87,76,65]],columns=[12,23,34,45,56])

###

In [56]:
c3

   12    23  34    45       56
0   1   2.0   3   4.0     None
1   5   6.0   7   8.0        9
2  11   NaN  12  13.0  missing
3  12  23.0  34   NaN       56
4  98  98.0  87  76.0       65

In [57]:
c3[[23,34]]

     23  34
0   2.0   3
1   6.0   7
2   NaN  12
3  23.0  34
4  98.0  87

In [58]:
c3[[23,45]][2:5]

     23    45
2   NaN  13.0
3  23.0   NaN
4  98.0  76.0

In [59]:
c3.shape

(5, 5)

In [60]:
c3.max()

C:\Users\hp\AppData\Local\Temp\ipykernel_13092\3674267463.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  c3.max()

12    98.0
23    98.0
34    87.0
45    76.0
dtype: float64

In [61]:
c3[23].max()

98.0

In [62]:
c3[55]=[56,67,456,34,45]

###

In [63]:
c3

   12    23  34    45       56   55
0   1   2.0   3   4.0     None   56
1   5   6.0   7   8.0        9   67
2  11   NaN  12  13.0  missing  456
3  12  23.0  34   NaN       56   34
4  98  98.0  87  76.0       65   45

In [64]:
c3[78]=c3[23]+c3[56]

In [65]:
c3

   12    23  34    45       56   55     78
0   1   2.0   3   4.0     None   56    NaN
1   5   6.0   7   8.0        9   67   15.0
2  11   NaN  12  13.0  missing  456    NaN
3  12  23.0  34   NaN       56   34   79.0
4  98  98.0  87  76.0       65   45  163.0

In [66]:
c3[12]<=50

0     True
1     True
2     True
3     True
4    False
Name: 12, dtype: bool

In [69]:
f=c3[55]>50

In [70]:
c3[f]

   12   23  34    45       56   55    78
0   1  2.0   3   4.0     None   56   NaN
1   5  6.0   7   8.0        9   67  15.0
2  11  NaN  12  13.0  missing  456   NaN